dog-app/app/controllers/dogs_controller.rb

SELECT "dogs".* FROM "dogs"
---
  def index
    @dogs = Dog.all

INSERT INTO "dogs" ("name", "motto", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "111"], ["motto", "dzfhd"], ["created_at", "2021-12-28 15:16:01.843700"], ["updated_at", "2021-12-28 15:16:01.843700"]]
---
  def create
    dog = Dog.create(dog_params)

DELETE FROM "dogs" WHERE "dogs"."id" = ?  [["id", 5]]
---
  def destroy

  @dog.destroy

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def current_dog
    @dog = Dog.find(params[:id])